code-review/NRB_3471_3546/База_Стало/InformationRegisters/РегистрНазначенныхКомиссий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегистрНазначенныхКомиссий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеТарифногоПлана</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/РегистрНазначенныхКомиссий/Ext/ManagerModule.bsl
Процедура ЗакрытьКомиссииПоДоговору(ДоговорКонтрагента) Экспорт
	
	ДатаЗакрытия = ДоговорКонтрагента.ДатаОкончанияДействия;
	Если Не ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрНазначенныхКомиссийСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
	|			&Период, 
	|			ДоговорКонтрагента = &ДоговорКонтрагента) КАК РегистрНазначенныхКомиссийСрезПоследних
	|ГДЕ
	|	РегистрНазначенныхКомиссийСрезПоследних.ФлагАктивности";
	Запрос.УстановитьПараметр("Период", ДатаЗакрытия);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаЗакрытия);
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ДоговорКонтрагента);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ДатаЗакрытия;
		НоваяЗапись.ДоговорКонтрагента = ДоговорКонтрагента;
		НоваяЗапись.Услуга = Выборка.Услуга;
		НоваяЗапись.ФлагАктивности = Ложь;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	УровеньИнформация = УровеньЖурналаРегистрации.Информация;
	ТекстСообщения = "Закрыты услуги на " + Формат(ДатаЗакрытия, "ДФ = ""дд.ММ.гггг""") + " по договору";
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения + " " + ДоговорКонтрагента);
	ЗаписьЖурналаРегистрации("Регистр назначенных комиссий", УровеньИнформация,, ДоговорКонтрагента, ТекстСообщения);
	
КонецПроцедуры
